;Доступные переменные:
;
;Основные:
;
;ПрефиксИБ -- Применимо к базе с префиксом
;Описание -- Описание выгрузки
;ПапкаВыгрузки -- Выгружать в папку (? -- выбрать папку до выгрузки, Temp\... -- использовать временную папку пользователя)
;Шаблон -- Наименование файла-шаблона выгрузки
;ИдентификаторДляАвтоВыгрузки -- строка-идентификатор для автоматической выгрузки по расписанию
;
;Доп. свойства:
;
;ТолькоОдинКонтрагент -- Разрешено выбирать только одного контрагента для выгрузки
;ОчиститьПапкуПередВыгрузкой -- Удалить все файлы из папки перед началом выгрузки
;ОграничитьПериод -- Ограничить период выгрузки (day -- один день, week -- одна неделя, month -- один месяц, year -- один год) -- пользователь сможет выбирать период только в соответствии с ограничением
;ДополнительныйСписок -- доп. список для выбора пользователя, элементы через запятые. Список может использоваться, как доп. пераметр внутри выгрузки.
;
;Фильтры:
;
;Номенклатура -- список кодов номенклатуры для выгрузки ч/з запятые
;Магазин -- список кодов магазинов для выгрузки ч/з запятые
;Склад -- список кодов складов для выгрузки ч/з запятые
;ЮрЛицо -- список кодов юридических лиц для выгрузки ч/з запятые
;Контрагент -- список кодов контрагентов для выгрузки ч/з запятые
;Договор -- список кодов договоров для выгрузки ч/з запятые
;
;Исполнение выражений:
;
;В любой переменной файла шаблона можно использовать исполняемые выражения. Выражение заключено в знаки !!!. Пример: !!!Replace(CreateGUID(),"-","")!!!
;

;Формат файла-шаблона:
;[<Файл1>]
;... (выгрузка из первого источника)
;[<Файл2>]
;... (выгрузка из второго источника)
;...
;
;Переменные:
;ИмяФайла="<ИмяФайлаВыгрузки>" -- имя файла, вычисление этой переменной (если указана формула), производится перед сохранением файла, поэтому можно использовать все переменные, заполненные выгрузкой ранее
;ВыложитьНаFTP="<user>:<password>@<ftpURL> [<FtpFolder\>] [<SOCKsProxyServer>:<ProxyPort>]" -- файл будет выложен на ftp после создания
;ОтослатьПоЭлектроннойПочте="<КоманднаяСтрокаУтилитыBlat>" -- пример: "-body " " -charset  Windows-1251 -server W44 -u admins -pw xxxxxxxxx -f "Admin <admins@forpost21.ru>" -to alko@cntgroup.ru -subject "Отчет Neon Максима ТК ООО !!!FormatDate(НачДата,"ddMMYYYY")!!!-!!!FormatDate(КонДата,"ddMMYYYY")!!!"
;ТипВыгрузки="<Тип>" -- 0: документы по строкам, 1: ведомость по остаткам ТМЦ, 2: Анализ продаж (по номенклатуре), 3: Список номенклатуры, 4: Анализ движения по документам (вкл. поступления)
;                       5: анализ продаж по документам (без поступлений), 6: Реестр движения по документам (вкл. поступления) -- без строк, 7: Реестр продаж по документам (без поступлений) -- без строк
;ОдинДокументНаФайл="<Флаг>" -- для каждого нового документа будет создан новый файл (только для выгрузки типа 0)
;ТипДокументов="<Тип>" -- используется для ТипВыгрузки=0 (пример: Реализация)
;КодОперации="<Код1>,<Код2>..." -- используется для ТипВыгрузки=0 (пример: РеализацияКомиссия,Реализация)
;КонвертироватьВUTF8="<Флаг>" -- конвертировать в UTF8 до записи
;КонвертироватьВПростуюТаблицу="<ЗнакРазделителя>" -- файл будет сохранен в XLS, не TXT
;ВыгружатьПоПартиям="<Флаг>" -- используется для ТипВыгрузки=0, выгружать по партиям, а не номенклатуре
;ОтниматьВозвратыОтРеализаций="<Флаг>" -- используется для ТипВыгрузки=0, рабоает как по партиям, так и без партий.
;КонвертироватьCRLFвLF="<Флаг>" -- превратить знаки $0d$0a для разделения строк в $0a
;ВыгружатьПоДням="<Флаг>" -- для типа 1, будет ли происходить выгрузка по дням
;ЗапуститьФайлПослеВыгрузки="<Файл>" -- Файл запускается после любой конвертации, до опций, типа ВыложитьНаFTP или ОтослатьПоЭлектроннойПочте
;                                       Можно использовать выражение !!!ФайлВыгрузки!!! для указания на имя файла выгрузки
;
;Разделы выгрузки:
;[!!!EXECUTE!!!
;<Исполняемое выражение, запускаемое один раз до начала выгрузки>
;!!!EXECUTE!!!]
;[!!!CHECKPASS!!!
;<Исполняемое выражение, запускаемое один раз до начала выгрузки, выполняется после исполнения запроса по выгрузке, может использоваться для проверки условий выгрузки перед ее началом для всех документов строк)>
;Доп. переменные:
;   ТипВыгрузки=0: З - запрос по документам выгрузки с одной группировкой с переменной "Док" для доступа к документам выгрузки
;!!!CHECKPASS!!!]
;
;@CONDITIONS@
;<УсловиеВыгрузки1>|<СообщениеОбОшибке1> -- если хотя бы одно из условий выполняется (1), выгрузка пропускает этот документ и сообщает об ошибке. Пример: !!!Trim(aDoc.АдресДоставки.ВнешнийКод)=""!!!|!!!"В адресе доставки "+aDoc.АдресДоставки.адСсылка+" не указан ""Уникальный код 2""!"!!!
;<УсловиеВыгрузки2>|<СообщениеОбОшибке2> --<УсловиеВыгрузки> -- указываются без знаков !!!, <СообщениеОбОшибке> -- должно содержать знаки !!! при необходимости
;...
;@CONDITIONS@
;
;@FILEHEADER@
;[!!!EXECUTE!!!
;<Исполняемое выражение, запускаемое каждый раз до выгрузки блока>
;!!!EXECUTE!!!]
;<Строка1>                    -- строки, выгружаемые в заголовок файла (один раз в одном файле)
;<Строка2>
;...
;@FILEHEADER@
;
;@HEADER@                     -- строки, выгружаемые один раз на один документ
;@BODY@                       -- строки, выгружаемые один раз на одну строку отчета (строку документа / партию документа)
;@FOOTER@                     -- строки, выгружаемые один раз на один документ после строк @BODY@
;@FILEFOOTER@                 -- строки, выгружаемые один раз на один файл после всех остальных строк 
;
;
;Доп. функции, доступные в выражениях при выгрузке из любого места:
;
;ПолучитьШтрихкод(<Номенклатура>) -- доп. функция
;ПолучитьСтавкуНДС(<ПеречислениеНЛС>) -- отдает цифру ставки НДС (0,10,18,20)
;ПолучитьИНН(<ДокументИлиКонтрагент>)
;ПолучитьКПП(<ДокументКонтрагентИлиАдресДоставки>)
;ПолучитьЛицензию(<Контрагент>,<АдресДоставки>=0,ИмяРеквизита="")
;ПолучитьДополнительноеСвойство(<Элемент>,<НаименованиеСвойства>)
;
;Особые переменные, доступные в выражениях при выгрузке:
;Все типы:
;КонДата,НачДата -- период отчета
;НомерСтроки -- текущая выгружаемая строка (документа или отчета)
;ФайлВыгрузки -- содержит имя текущего выгружаемого файла

;Тип 0:
;aDoc -- текущий выгружаемый документ
;aLP -- текущая выгружаемая строчная часть документа (либо таблица движения с партиями), позиционированная на требуемыю позицию (пример: !!!aLP.Номенклатура.Code!!!)
;       Всегда содержит столбики Номенклатура,Количество,СтавкаНДС,Сумма,СуммаНДС, иногда содержит столбики Партия и пр. в зависимости от типа документа
;aVars -- Список значений, в котором можно хранить любую информацию
;
;Тип 1:
;ТекДата -- текущий день выгрузки (при выгрузке по дням)
;Номенклатура -- текущая выгружаемая номенклатура
;КоличествоНачало -- количество остатков (в штуках) на начало периода
;КоличествоКонец -- количество остатков (в штуках) на конец периода
;КоличествоПриход -- количество остатков (в штуках) (приход за период)
;КоличествоРасход -- количество остатков (в штуках) (расход за период)
;
;
;Тип 2,4,5:
;Номенклатура -- текущая выгружаемая номенклатура
;Сумма -- сумма продаж
;Количество -- количество продаж (в штуках)
;Себестоимость -- себестоимость продаж
;
;Тип 3:
;Номенклатура -- текущая выгружаемая номенклатура
;

;Пример:
;[Выгрузка ?]
;ПрефиксИБ="?"
;Описание="?"
;ПапкаВыгрузки=""
;Шаблон="?.ini"
;Номенклатура="000000000001,000000000002"
;Склад="000000000001,000000000002"
;Контрагент="000000000001"
;ОчиститьПапкуПередВыгрузкой="0"



